tap "hashicorp/tap"
tap "homebrew/cask-fonts"

# Binaries / Tools.
brew "awscli"
brew "bash"
brew "bash-completion"
brew "circleci"
brew "cocoapods"
# brew "docker-completion"
brew "git"
brew "go"
brew "gopls"
brew "hashicorp/tap/terraform"
brew "helm"
brew "hyperkit"
brew "jq"
brew "make"
brew "mas"
brew "md5sha1sum"
brew "nvm"
brew "swiftlint"
brew "telnet"
brew "tfsec"
brew "tldr"
brew "tree"
brew "vim"
brew "watch"

cask "google-chrome"
cask "firefox"
cask "gpg-suite-no-mail"
cask "mmhmm"
cask "visual-studio-code"
cask "warp"

# Fonts.
# Once installed, edit iTerm2 Preferences to use the font:
#   Profiles > Text > Font > Meslo
# TODO: Check in iTerm2 settings file.
cask "font-meslo-for-powerline"

# Quicklook Plugins.
# May need to run:
#   $ xattr -cr ~/Library/QuickLook/QLStephen.qlgenerator
#   $ qlmanage -r
#   $ qlmanage -r cache
# Then relaunch Finder (Option + Right-Click Finder > Relaunch).
cask "qlmarkdown"
cask "syntax-highlight"

# Applications.
mas "Slack", id: 803453959
mas "Xcode", id: 497799835
#mas "Ubiquiti WiFiman", id: 1385561119 # https://github.com/mas-cli/mas/issues/321

cask "docker"
cask "ngrok"
cask "spotify"
