tap "hashicorp/tap"
tap "homebrew/cask-fonts"

# Binaries / Tools.
brew "awscli"
brew "bash"
brew "bash-completion"
brew "circleci"
brew "docker-completion"
brew "git"
brew "hashicorp/tap/terraform"
brew "hyperkit"
brew "jq"
brew "make"
brew "mas"
brew "nvm"
brew "telnet"
brew "tldr"
brew "tree"
brew "vim"
brew "watch"

cask "gpg-suite-no-mail"
cask "mmhmm"

# Fonts.
# Once installed, edit iTerm2 Preferences to use the font:
#   Profiles > Text > Font > Meslo
# TODO: Check in iTerm2 settings file.
cask "font-meslo-for-powerline"

# Quicklook Plugins.
# May need to run:
#   $ xattr -cr ~/Library/QuickLook/QLStephen.qlgenerator
#   $ qlmanage -r
#   $ qlmanage -r cache
# Then relaunch Finder (Option + Right-Click Finder > Relaunch).
cask "qlcolorcode"
cask "qlmarkdown"
cask "quicklook-json"
cask "quicklook-csv"
cask "qlstephen"

# Applications.
mas "Slack", id: 803453959

cask "docker"
cask "spotify"
